DataProcessors/DataExchangeWithSiteCreationAssistant.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>DataExchangeWithSiteCreationAssistant</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ImportingDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SiteAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportPictures</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataCompositionSettingsComposer</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartiesIdentificationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartiesIdentificationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyToSubstituteIntoOrders</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupForNewProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupForNewCounterparties</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseScheduledJobs</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportToSite</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrdersExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SavedDirectoriesTable</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobSchedule</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeNodeRef</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ExchangeSmallBusinessSite</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyToSubstituteIntoOrders</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportBalanceForWarehouses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PriceKinds</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PriceKind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/DataExchangeWithSiteCreationAssistant/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

Procedure RunNewDataExchangeCreationActions(Cancel) Export
	
	SetPrivilegedMode(True);
	
	BeginTransaction();
	
	Try
		
		NewNode = ExchangePlans.ExchangeSmallBusinessSite.CreateNode();
		NewNode.SetNewCode();
		
		FillPropertyValues(NewNode, ThisObject);
		
		For Each TableRow IN PriceKinds Do
			
			NewRow = NewNode.PriceKinds.Add();
			FillPropertyValues(NewRow, TableRow);
			
		EndDo;
		
		If Not ExportToSite Then 
			
			NewNode.ImportFile = TrimAll(ImportingDirectory) + "\Orders.xml";
			
		EndIf;
		
		If ProductsExchange AND OrdersExchange Then
			
			ExchangeDescription = "Product and order exchange with WEB site";
			
		ElsIf ProductsExchange Then
			
			ExchangeDescription = "Product export on WEB site";
			
		Else
			
			ExchangeDescription = "Order exchange with WEB site";
			
		EndIf;
		
		NewNode.Description = ExchangeDescription + " (" + TrimAll(NewNode.Code) + ")";
		
		If UseScheduledJobs
			AND JobSchedule <> Undefined Then 
			
			JobID = ExchangeWithSiteScheduledJobs.CreateNewJob(NewNode.Code, NewNode.Description, JobSchedule);
			NewNode.ScheduledJobID = JobID;
			
		EndIf;
		
		NewNode.PerformFullExportingCompulsorily = True;
		
		NewNode.Write();
		
		ExchangeWithSite.UpdateSessionParameters();
		
		ExchangeNodeRef = NewNode.Ref;
		
	Except
		
		MessageText = NStr("en = 'Error was occurred on data exchange settings saving: '");
		
		DataExchangeServer.ShowMessageAboutError(MessageText + ErrorDescription(), Cancel);
		WriteLogEvent(MessageText, EventLogLevel.Error,,, ErrorDescription());
		
	EndTry;
	
	If Cancel Then
		
		RollbackTransaction();
		
	Else
		
		CommitTransaction();
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
